tutorials/tutorials/incompressible/porousSimpleFoam/angledDuctImplicit/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            noSlip;
    }
    back
    {
        type            noSlip;
    }
    walls
    {
        type            noSlip;
    }
    porosityWall
    {
        type            slip;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate  constant 0.1;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}

// ************************************************************************* //
